// 1) Дан массив с элементами [1, 2, 3, 4, 5].
// С помощью цикла for найдите сумму элементов этого массива.
// Запишите ее в переменную result.

// let arr=[1,2,3,4,5]
// let rezult=0
// for (let i = 0; i < arr.length; i++) {
//   rezult+=arr[i]
// }
// console.log(rezult)


//
// 2) [1, 2, 3, 4, 5, 6, 7, 8, 9, 10] => сумму всех элементов массива

// let arr=[1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
// let rezult=0
// for (let i = 0; i < arr.length; i++) {
//     rezult+=arr[i]
// }
// console.log(rezult)


//
// 3) Дан массив с элементами [1, 2, 5, 9, 4, 13, 4, 10].
// С помощью цикла for и оператора if проверьте есть ли в массиве элемент со значением,
// равным 4. Если есть - выведите на экран 'Есть!' и выйдите из цикла. Если нет - 'Нет!'

// let arr=[1, 2, 5, 9, 4, 13, 4, 10]
// for (let i = 0; i < arr.length; i++) {
//     if (arr[i]===4 ){
//         console.log('Есть')
//         break
//     }else {
//         console.log('Нет')
//     }
// }

